{"class_name": "Model", "config": {"output_layers": [["softmax_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 187, 1], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "valid", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_2"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_3"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}], ["conv1d_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "padding": "valid", "pool_size": [5], "data_format": "channels_last", "name": "max_pooling1d_2"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "max_pooling1d_2"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_6"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "conv1d_6"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_7"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}], ["max_pooling1d_2", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "padding": "valid", "pool_size": [5], "data_format": "channels_last", "name": "max_pooling1d_3"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "max_pooling1d_3"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_8"}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "name": "conv1d_8"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_9"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv1d_9"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["conv1d_9", 0, 0, {}], ["max_pooling1d_3", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "padding": "valid", "pool_size": [5], "data_format": "channels_last", "name": "max_pooling1d_4"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "max_pooling1d_4"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_10"}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]], "name": "conv1d_10"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "trainable": true, "filters": 32, "strides": [1], "padding": "same", "kernel_size": [5], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv1d_11"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv1d_11"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["conv1d_11", 0, 0, {}], ["max_pooling1d_4", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "padding": "valid", "pool_size": [5], "data_format": "channels_last", "name": "max_pooling1d_5"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "max_pooling1d_5"}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 32, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 32, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 5, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_3"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Softmax", "config": {"trainable": true, "name": "softmax_1", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "softmax_1"}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}